FindDish/app/controllers/usuarios_controller.rb

SELECT `usuarios`.* FROM `usuarios`
---
  def index
    @usuarios = Usuario.all

INSERT INTO `usuarios` (`nombre`, `apellido`, `cedula`, `numero`, `email`, `created_at`, `updated_at`) VALUES ('Gabriele', 'Iafigliola', '25533132', 2122912142, 'gaboiaf@gmail.com', '2016-10-11 21:17:14', '2016-10-11 21:17:14')
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

UPDATE `usuarios` SET `apellido` = 'Granados', `updated_at` = '2016-10-11 21:32:57' WHERE `usuarios`.`id` = 1
---
  def update
    respond_to do |format|
      if @usuario.update(usuario_params)

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1
---
    def set_usuario
      @usuario = Usuario.find(params[:id])