app/controllers/establecimientos_controller.rb

SELECT `establecimientos`.* FROM `establecimientos`
---
  def index
    @establecimientos = Establecimiento.all

INSERT INTO `establecimientos` (`nombre`, `especialidad`, `email`, `calificacion`, `direccion`, `rif`, `telefono`, `created_at`, `updated_at`) VALUES ('Gabriele', 'Pasta', 'Gaboiaf@taco.com', 5, 'La Guaira', '1234', 1234, '2016-11-17 13:04:48', '2016-11-17 13:04:48')
---
  def create
    @establecimiento = Establecimiento.new(establecimiento_params)

    respond_to do |format|
      if @establecimiento.save

SELECT  `establecimientos`.* FROM `establecimientos` WHERE `establecimientos`.`id` = 1 LIMIT 1
---
    def set_establecimiento
      @establecimiento = Establecimiento.find(params[:id])