app/controllers/platillos_controller.rb

  def index
    @platillos = Platillo.all
---
SELECT `platillos`.* FROM `platillos`

    def set_platillo
      @platillo = Platillo.find(params[:id])
---
SELECT  `platillos`.* FROM `platillos` WHERE `platillos`.`id` = NULL LIMIT 1

    def set_establecimiento
      @establecimiento = Establecimiento.find(params[:id])
---
SELECT  `establecimientos`.* FROM `establecimientos` WHERE `establecimientos`.`id` = NULL LIMIT 1