app/controllers/reservas_controller.rb

  def index
    @reservas = Reserva.all
---
SELECT `reservas`.* FROM `reservas`

  def create
    @reserva = Reserva.new(reserva_params)

    respond_to do |format|
      if @reserva.save
---
INSERT INTO `reservas` (`fecha`, `hora`, `estado`, `created_at`, `updated_at`) VALUES ('0012-11-19', '18:09:00', 'Activa', '2016-11-17 14:33:58', '2016-11-17 14:33:58')

    def set_reserva
      @reserva = Reserva.find(params[:id])
---
SELECT  `reservas`.* FROM `reservas` WHERE `reservas`.`id` = 1 LIMIT 1