app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT `usuarios`.* FROM `usuarios`

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `cedula`, `numero`, `email`, `created_at`, `updated_at`) VALUES ('Gabriele', 'Iafigliola', '25533132', 2122912142, 'gaboiaf@gmail.com', '2016-10-11 21:17:14', '2016-10-11 21:17:14')

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE `usuarios` SET `apellido` = 'Granados', `updated_at` = '2016-10-11 21:32:57' WHERE `usuarios`.`id` = 1

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1